<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of BankID and imports into Munki.

Postinstall script extracts the DropboxHelperInstaller and sets the setuid 
bit so that it can perform its setup tasks as root without asking for admin 
privileges.

Dropbox will attempt to update periodically, and if it does not have permission to 
overwrite the bundle at /Applications/Dropbox.app, it will instead download 
the updated version to ~/Library/Dropbox, and run this version as long as it 
is more recent than the copy in /Applications.

This recipe assumes the user cannot write to the installed version at
/Applications/Dropbox.app, and therefore merges an installs key with a versionless
Dropbox file item, so that if a newer version of Dropbox is ever imported
into the repo, it will not trigger updates on clients whose newer version is only
located in their user's home folder.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.munki.bankid</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/BankID</string>
        <key>NAME</key>
        <string>BankID/string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>For secure and encrypted transactions.</string>
            <key>display_name</key>
            <string>BankID</string>
            <key>name</key>
            <string>%NAME%</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.bankid</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>installs</key>
                    <array>
                        <dict>
                            <key>CFBundleIdentifier</key>
                            <string>com.getbankid.bankid</string>
                            <key>CFBundleName</key>
                            <string>BankID</string>
                            <key>path</key>
                            <string>/Applications/BankID.app</string>
                            <key>type</key>
                            <string>file</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
