<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of BankID</string>
    <key>Identifier</key>
    <string>com.github.autopkg.download.bankid</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>BankID</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
            	<key>url</key>
            	<string>https://install.bankid.com/FileDownloader?fileId=Mac</string>
                <key>filename</key>
                <string>%NAME%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
